{"format": "layers-model", "generatedBy": "keras v2.7.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "modelTopology": {"keras_version": "2.7.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "name": "add", "inbound_nodes": [[["conv2d", 0, 0, {}], ["conv2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3", "inbound_nodes": [[["add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "name": "add_1", "inbound_nodes": [[["add", 0, 0, {}], ["conv2d_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_2", "trainable": true, "dtype": "float32"}, "name": "add_2", "inbound_nodes": [[["add_1", 0, 0, {}], ["conv2d_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_7", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_8", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3", "trainable": true, "dtype": "float32"}, "name": "add_3", "inbound_nodes": [[["add_2", 0, 0, {}], ["conv2d_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_9", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_10", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_4", "trainable": true, "dtype": "float32"}, "name": "add_4", "inbound_nodes": [[["add_3", 0, 0, {}], ["conv2d_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_11", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_11", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_12", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_12", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_5", "trainable": true, "dtype": "float32"}, "name": "add_5", "inbound_nodes": [[["add_4", 0, 0, {}], ["conv2d_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_13", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_13", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_14", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_14", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_6", "trainable": true, "dtype": "float32"}, "name": "add_6", "inbound_nodes": [[["conv2d_13", 0, 0, {}], ["conv2d_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_15", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_15", "inbound_nodes": [[["add_6", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["conv2d_15", 0, 0]]}}, "training_config": {"loss": "mean_squared_error", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "mean_squared_error", "dtype": "float32", "fn": "mean_squared_error"}}, {"class_name": "MeanMetricWrapper", "config": {"name": "psnr", "dtype": "float32", "fn": "psnr"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d/kernel", "shape": [3, 3, 3, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.14391772700291053, "scale": 0.0011243572422102385, "original_dtype": "float32"}}, {"name": "conv2d/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.008867746949488041, "scale": 6.769272480525222e-05, "original_dtype": "float32"}}, {"name": "conv2d_1/kernel", "shape": [3, 3, 32, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4528702567605411, "scale": 0.0037739188063378427, "original_dtype": "float32"}}, {"name": "conv2d_1/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.511291414382411, "scale": 0.0035019959889206233, "original_dtype": "float32"}}, {"name": "conv2d_10/kernel", "shape": [3, 3, 128, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.20277158319950103, "scale": 0.00159662663936615, "original_dtype": "float32"}}, {"name": "conv2d_10/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.007697526310734889, "scale": 5.420793176573865e-05, "original_dtype": "float32"}}, {"name": "conv2d_11/kernel", "shape": [3, 3, 32, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.13708466948831785, "scale": 0.0010154419962097618, "original_dtype": "float32"}}, {"name": "conv2d_11/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.051473955576326336, "scale": 0.00036249264490370657, "original_dtype": "float32"}}, {"name": "conv2d_12/kernel", "shape": [3, 3, 128, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.28750169902455575, "scale": 0.0019295416041916493, "original_dtype": "float32"}}, {"name": "conv2d_12/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.00716029909603736, "scale": 6.951746695181903e-05, "original_dtype": "float32"}}, {"name": "conv2d_13/kernel", "shape": [3, 3, 32, 12], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.129011131735409, "scale": 0.001007899466682883, "original_dtype": "float32"}}, {"name": "conv2d_13/bias", "shape": [12], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.003470808546990156, "scale": 3.4027534774413295e-05, "original_dtype": "float32"}}, {"name": "conv2d_14/kernel", "shape": [5, 5, 3, 12], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.12921693839278875, "scale": 0.001009507331193662, "original_dtype": "float32"}}, {"name": "conv2d_14/bias", "shape": [12], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.003470808546990156, "scale": 3.4027534774413295e-05, "original_dtype": "float32"}}, {"name": "conv2d_15/kernel", "shape": [3, 3, 12, 3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.21480944898782992, "scale": 0.0016914129841561411, "original_dtype": "float32"}}, {"name": "conv2d_15/bias", "shape": [3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.001911459374241531, "scale": 7.576899438658181e-06, "original_dtype": "float32"}}, {"name": "conv2d_2/kernel", "shape": [3, 3, 128, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.23385869919085034, "scale": 0.002016023268886641, "original_dtype": "float32"}}, {"name": "conv2d_2/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.00830349572660292, "scale": 7.220431066611234e-05, "original_dtype": "float32"}}, {"name": "conv2d_3/kernel", "shape": [3, 3, 32, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.24548584439006504, "scale": 0.0019329594046461815, "original_dtype": "float32"}}, {"name": "conv2d_3/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09849599018400791, "scale": 0.0012467846858735178, "original_dtype": "float32"}}, {"name": "conv2d_4/kernel", "shape": [3, 3, 128, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3130391064812155, "scale": 0.001956494415507597, "original_dtype": "float32"}}, {"name": "conv2d_4/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.006560265075634507, "scale": 5.2065595838369106e-05, "original_dtype": "float32"}}, {"name": "conv2d_5/kernel", "shape": [3, 3, 32, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2879555660719965, "scale": 0.001857777845625784, "original_dtype": "float32"}}, {"name": "conv2d_5/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.08091015032693451, "scale": 0.0005779296451923893, "original_dtype": "float32"}}, {"name": "conv2d_6/kernel", "shape": [3, 3, 128, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.19284745285324023, "scale": 0.0018723053675071867, "original_dtype": "float32"}}, {"name": "conv2d_6/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.006552574458513774, "scale": 5.37096267091293e-05, "original_dtype": "float32"}}, {"name": "conv2d_7/kernel", "shape": [3, 3, 32, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11965962449709573, "scale": 0.0009889225165049234, "original_dtype": "float32"}}, {"name": "conv2d_7/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.029738775480027294, "scale": 0.0003065853142270855, "original_dtype": "float32"}}, {"name": "conv2d_8/kernel", "shape": [3, 3, 128, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.13872534954080395, "scale": 0.00114649049207276, "original_dtype": "float32"}}, {"name": "conv2d_8/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.007444509600891786, "scale": 5.279794043185664e-05, "original_dtype": "float32"}}, {"name": "conv2d_9/kernel", "shape": [3, 3, 32, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.23127454893261779, "scale": 0.0019113599085340313, "original_dtype": "float32"}}, {"name": "conv2d_9/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.49053371333900614, "scale": 0.002123522568567126, "original_dtype": "float32"}}]}]}